Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::DuctTransitionPreferenceTable::Modifier Class Reference
MEP Element Manager
Modifier of the DuctTransitionPreferenceTable. More...
#include <MEPDuctTransitionPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::DuctTransitionPreferenceTable::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewRow (const Key &key)
Inserts a new row into the table.
Result< void >  | DeleteRow (uint32_t index)
Deletes a row from the table.
Result< void >  | DeleteRowByKey (const Key &key)
Deletes a row from the table.
Result< void >  | SetBeginDiameter (uint32_t index, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetBeginDiameterByKey (const Key &key, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetEndDiameter (uint32_t index, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetEndDiameterByKey (const Key &key, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetAngle (uint32_t index, double angle)
Sets the angle value of a table's row.
Result< void >  | SetAngleByKey (const Key &key, double angle)
Sets the angle value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByKey (const Key &key, const GS::UniString &description)
Sets the description of a table's row.
 Protected Member Functions
Modifier (DuctTransitionPreferenceTable &parent)
Constructs a Modifier with the given DuctTransitionPreferenceTable.
Detailed Description
Modifier of the DuctTransitionPreferenceTable.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::Modifier  |  ( |  DuctTransitionPreferenceTable & |  parent | )
protected
Constructs a Modifier with the given DuctTransitionPreferenceTable.
Parameters
parent | The given DuctTransitionPreferenceTable.
Member Function Documentation
◆ AddNewRow()
 Result< uint32_t > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::AddNewRow  |  ( |  const Key & |  key | )
Inserts a new row into the table.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
If endReferenceId is larger than the beginReferenceId, the two values will be swapped before insertion.
Returns
Returns error if the pair of referenceIds is already present in the table, otherwise the index of the new row.
◆ DeleteRow()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::DeleteRow  |  ( |  uint32_t |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ DeleteRowByKey()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::DeleteRowByKey  |  ( |  const Key & |  key | )
Deletes a row from the table.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise nothing.
◆ SetAngle()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetAngle  |  ( |  uint32_t |  index,
|  double |  angle )
Sets the angle value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
angle | The value to be set. Needs to be between [1, 89] degrees.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
◆ SetAngleByKey()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetAngleByKey  |  ( |  const Key & |  key,
|  double |  angle )
Sets the angle value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
angle | The value to be set. Needs to be between [1, 89] degrees.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
◆ SetBeginDiameter()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetBeginDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the begin diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetBeginDiameterByKey()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetBeginDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the begin diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the DuctReferenceSet, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetDescription  |  ( |  uint32_t |  index,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByKey()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetDescriptionByKey  |  ( |  const Key & |  key,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
description | The description to be set.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the DuctReferenceSet, otherwise nothing.
◆ SetEndDiameter()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetEndDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the end diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetEndDiameterByKey()
 Result< void > ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetEndDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the end diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the DuctTransitionPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the DuctReferenceSet, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::DuctTransitionPreferenceTable::Modifier::SetName  |  ( |  const GS::UniString & |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.